app/controllers/admin/dashboard_controller.rb

  def index
    # 전체 통계
    @total_users = User.count
    @total_knowledges = Knowledge.count
    @total_subscriptions = Subscription.count
    @active_subscriptions = Subscription.active.count

    # 오늘 통계
    @today_users = User.where(created_at: Date.current.beginning_of_day..Date.current.end_of_day).count
    @today_knowledges = Knowledge.where(created_at: Date.current.beginning_of_day..Date.current.end_of_day).count
    @today_revenue = Subscription.where(created_at: Date.current.beginning_of_day..Date.current.end_of_day, status: 'active').sum(:amount)

    # 이번 달 통계
    @monthly_users = User.where(created_at: Date.current.beginning_of_month..Date.current.end_of_month).count
    @monthly_knowledges = Knowledge.where(created_at: Date.current.beginning_of_month..Date.current.end_of_month).count
    @monthly_revenue = Subscription.where(created_at: Date.current.beginning_of_month..Date.current.end_of_month, status: 'active').sum(:amount)

    # 플랜별 사용자 분포
    @plan_distribution = {
      free: User.joins(:user_setting).where(user_settings: { plan_type: 'free' }).count,
      pro: User.joins(:user_setting).where(user_settings: { plan_type: 'pro' }).count,
      business: User.joins(:user_setting).where(user_settings: { plan_type: 'business' }).count
    }

    # 콘텐츠 타입별 분포
    @content_distribution = {
      youtube: Knowledge.where(content_type: 'youtube').count,
      article: Knowledge.where(content_type: 'article').count,
      thread: Knowledge.where(content_type: 'thread').count
    }

    # 최근 가입 사용자
    @recent_users = User.order(created_at: :desc).limit(10)

    # 최근 처리된 콘텐츠
    @recent_knowledges = Knowledge.includes(:user).order(created_at: :desc).limit(10)

    # 처리 상태별 분포
    @processing_status = {
      completed: Knowledge.where(status: 'completed').count,
      processing: Knowledge.where(status: 'processing').count,
      failed: Knowledge.where(status: 'failed').count
    }

    # 크레딧 사용 통계
    @total_credits_used = UserSetting.sum(:used_credits)
    @average_credits_per_user = UserSetting.average(:used_credits)&.round(2) || 0
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "knowledges"
SELECT COUNT(*) FROM "subscriptions"
SELECT COUNT(*) FROM "users" WHERE "users"."created_at" BETWEEN '2025-09-02 00:00:00' AND '2025-09-02 23:59:59.999999'
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."created_at" BETWEEN '2025-09-02 00:00:00' AND '2025-09-02 23:59:59.999999'
SELECT SUM("subscriptions"."amount") FROM "subscriptions" WHERE "subscriptions"."created_at" BETWEEN '2025-09-02 00:00:00' AND '2025-09-02 23:59:59.999999' AND "subscriptions"."status" = 'active'
SELECT COUNT(*) FROM "users" WHERE "users"."created_at" BETWEEN '2025-09-01' AND '2025-09-30'
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."created_at" BETWEEN '2025-09-01' AND '2025-09-30'
SELECT SUM("subscriptions"."amount") FROM "subscriptions" WHERE "subscriptions"."created_at" BETWEEN '2025-09-01' AND '2025-09-30' AND "subscriptions"."status" = 'active'
SELECT COUNT(*) FROM "users" INNER JOIN "user_settings" ON "user_settings"."user_id" = "users"."id" WHERE "user_settings"."plan_type" = 'business'
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."content_type" = 'youtube'
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT 10
SELECT "knowledges".* FROM "knowledges" ORDER BY "knowledges"."created_at" DESC LIMIT 10
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."status" = 'processing'
SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."user_id" = 2 LIMIT 1
SELECT SUM("user_settings"."used_credits") FROM "user_settings"
SELECT AVG("user_settings"."used_credits") FROM "user_settings"

    # 시간별 처리량 (최근 24시간)
    @hourly_processing = (0..23).map do |hour|
      time = hour.hours.ago
      count = Knowledge.where(created_at: time.beginning_of_hour..time.end_of_hour).count
---
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."created_at" BETWEEN '2025-09-02 06:00:00' AND '2025-09-02 06:59:59.999999'

    # 일별 가입자 수 (최근 30일)
    @daily_signups = (0..29).map do |day|
      date = day.days.ago.to_date
      count = User.where(created_at: date.beginning_of_day..date.end_of_day).count
---
SELECT COUNT(*) FROM "users" WHERE "users"."created_at" BETWEEN '2025-09-02 00:00:00' AND '2025-09-02 23:59:59.999999'

  def users
    @users = User.includes(:user_setting, :subscriptions)
                 .page(params[:page])
                 .per(20)
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" IN (1, 2)
SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."user_id" IN (1, 2)
SELECT "users".* FROM "users" LIMIT 20 OFFSET 0

  def knowledges
    @knowledges = Knowledge.includes(:user)
                           .order(created_at: :desc)
                           .page(params[:page])
                           .per(20)
---
SELECT "knowledges".* FROM "knowledges" ORDER BY "knowledges"."created_at" DESC LIMIT 20 OFFSET 0

  def subscriptions
    @subscriptions = Subscription.includes(:user)
                                 .order(created_at: :desc)
                                 .page(params[:page])
                                 .per(20)
---
SELECT "subscriptions".* FROM "subscriptions" ORDER BY "subscriptions"."created_at" DESC LIMIT 20 OFFSET 0

  def analytics
    # 상세 분석 페이지
    @revenue_by_month = (0..11).map do |month|
      date = month.months.ago
      revenue = Subscription.where(
        created_at: date.beginning_of_month..date.end_of_month,
        status: 'active'
      ).sum(:amount)
      { month: date.strftime('%Y-%m'), revenue: revenue }
    end.reverse

    @user_growth = (0..11).map do |month|
      date = month.months.ago
      count = User.where(created_at: date.beginning_of_month..date.end_of_month).count
      { month: date.strftime('%Y-%m'), count: count }
    end.reverse

    @content_growth = (0..11).map do |month|
      date = month.months.ago
      count = Knowledge.where(created_at: date.beginning_of_month..date.end_of_month).count
      { month: date.strftime('%Y-%m'), count: count }
    end.reverse

    # 토큰 사용량 통계
    @token_usage = {
      total_input: Knowledge.sum(:input_tokens),
      total_output: Knowledge.sum(:output_tokens),
      average_input: Knowledge.average(:input_tokens)&.round(0) || 0,
      average_output: Knowledge.average(:output_tokens)&.round(0) || 0
---
SELECT SUM("subscriptions"."amount") FROM "subscriptions" WHERE "subscriptions"."created_at" BETWEEN '2025-09-01 00:00:00' AND '2025-09-30 23:59:59.999999' AND "subscriptions"."status" = 'active'
SELECT COUNT(*) FROM "users" WHERE "users"."created_at" BETWEEN '2025-09-01 00:00:00' AND '2025-09-30 23:59:59.999999'
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."created_at" BETWEEN '2025-09-01 00:00:00' AND '2025-09-30 23:59:59.999999'
SELECT SUM("knowledges"."output_tokens") FROM "knowledges"