app/views/admin/dashboard/users.html.erb

              <td class="px-6 py-4 text-sm text-gray-400">
                <%= user.knowledges.count %>
---
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."user_id" = 1