app/controllers/dashboard_controller.rb

SELECT "knowledge_tags".* FROM "knowledge_tags" WHERE "knowledge_tags"."knowledge_id" IN (9, 8)
SELECT "knowledges".* FROM "knowledges" WHERE "knowledges"."user_id" = 1 ORDER BY "knowledges"."created_at" DESC LIMIT 10
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (7, 8, 9, 10, 11, 12, 13, 14, 15)
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."user_id" = 1
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."user_id" = 1 AND "knowledges"."content_type" = 'youtube'
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."user_id" = 1 AND "knowledges"."content_type" = 'article'
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."user_id" = 1 AND "knowledges"."content_type" = 'thread'
SELECT COUNT(*) FROM "knowledges" WHERE "knowledges"."user_id" = 1 AND "knowledges"."created_at" BETWEEN '2025-09-01 00:00:00' AND '2025-09-01 04:43:55.407638'
INSERT INTO "user_settings" ("user_id", "email_notifications", "privacy_mode", "language", "timezone", "monthly_credit_limit", "used_credits", "theme", "email_verified", "email_verified_at", "verification_token", "last_credit_reset_at", "preferences", "created_at", "updated_at") VALUES (1, TRUE, 'private', 'ko', 'Asia/Seoul', 100, 0, 'dark', FALSE, NULL, NULL, NULL, '{}', '2025-09-02 03:24:08.676322', '2025-09-02 03:24:08.676322') RETURNING "id"
SELECT "tags".* FROM "tags" ORDER BY "tags"."count" DESC LIMIT 10
SELECT "user_settings".* FROM "user_settings" WHERE "user_settings"."user_id" = 1 LIMIT 1
---
  def index
    if user_signed_in?
      @recent_knowledges = current_user.knowledges.includes(:tags, :knowledge_tags).recent.limit(10)
      @total_knowledges = current_user.knowledges.count
      @youtube_count = current_user.knowledges.where(content_type: 'youtube').count
      @article_count = current_user.knowledges.where(content_type: 'article').count
      @thread_count = current_user.knowledges.where(content_type: 'thread').count
      @this_month_count = current_user.knowledges.where(created_at: Time.current.beginning_of_month..Time.current).count
      @popular_tags = Tag.popular

      # 이메일 기반 사용량 추적
      @user_setting = current_user.user_setting || current_user.create_user_setting!
      @current_usage = current_user.current_month_usage
      @credits_remaining = @user_setting.monthly_credit_limit - @user_setting.used_credits
      @email_verified = current_user.email_verified?

      # 구독 정보
      @active_subscription = current_user.subscriptions.active.first