app/controllers/knowledges_controller.rb

  def create
    Rails.logger.info "=== KnowledgesController#create called ==="
    Rails.logger.info "Params: #{params.inspect}"
    Rails.logger.info "Current user: #{current_user.id} - #{current_user.email}"

    # 크레딧 사용 가능 여부 체크
    unless current_user.can_use_credit?
      redirect_to root_path, alert: "이번 달 크레딧을 모두 사용하셨습니다. 다음 달에 다시 이용해주세요."
      return
    end

    # 기존 URL 체크
    existing_knowledge = current_user.knowledges.find_by(original_url: params[:url])
---
SELECT "knowledges".* FROM "knowledges" WHERE "knowledges"."user_id" = 1 AND "knowledges"."original_url" = 'https://docs.anthropic.com/ko/docs/build-with-claude/prompt-engineering/overview' LIMIT 1


    Rails.logger.info "Building knowledge: #{@knowledge.inspect}"

    if @knowledge.save
---
INSERT INTO "knowledges" ("user_id", "original_url", "title", "content", "summary", "content_type", "status", "thumbnail_url", "duration", "metadata", "created_at", "updated_at", "keywords", "published_at", "error_message", "started_at", "completed_at", "input_tokens", "output_tokens", "credits_consumed") VALUES (1, 'https://youtu.be/SlnyZSoTQ3A?si=hqpwWpA2B70LkKA2', NULL, NULL, NULL, NULL, 'processing', NULL, NULL, '{}', '2025-09-02 13:36:13.345244', '2025-09-02 13:36:13.345244', NULL, NULL, NULL, NULL, NULL, 0, 0, 0.0) RETURNING "id"

  def show
    @knowledge = current_user.knowledges.find(params[:id])
---
SELECT "knowledges".* FROM "knowledges" WHERE "knowledges"."user_id" = 1 AND "knowledges"."id" = 4 LIMIT 1

  def retry
    @knowledge = current_user.knowledges.find(params[:id])

    if @knowledge.status == "failed"
      @knowledge.update(status: "processing", error_message: nil)
---
SELECT "knowledges".* FROM "knowledges" WHERE "knowledges"."user_id" = 1 AND "knowledges"."id" = 10 LIMIT 1
UPDATE "knowledges" SET "status" = 'processing', "updated_at" = '2025-09-02 03:59:59.177427', "error_message" = NULL WHERE "knowledges"."id" = 10

  def destroy
    @knowledge = current_user.knowledges.find(params[:id])
    @knowledge.destroy
---
SELECT "knowledges".* FROM "knowledges" WHERE "knowledges"."user_id" = 1 AND "knowledges"."id" = 20 LIMIT 1
DELETE FROM "knowledges" WHERE "knowledges"."id" = 20