app/models/knowledge.rb

  def extract_and_save_tags
    return unless summary.present?

    # Extract keywords from the existing keywords field
    if keywords.present?
      begin
        keyword_list = JSON.parse(keywords)
        keyword_list.each do |keyword|
          tag = Tag.increment_count(keyword)
          knowledge_tags.find_or_create_by(tag: tag)
---
INSERT INTO "knowledge_tags" ("knowledge_id", "tag_id", "created_at", "updated_at") VALUES (3, 1, '2025-09-01 07:01:59.910081', '2025-09-01 07:01:59.910081') RETURNING "id"