app/models/tag.rb

  def self.increment_count(tag_name)
    tag = find_or_create_by(name: tag_name.downcase)
    tag.increment!(:count)
---
UPDATE "tags" SET "count" = COALESCE("count", 0) + 1 WHERE "tags"."id" = 1