app/models/user.rb

  def current_month_usage
    current_date = Date.current
    usage_trackings.find_or_create_by(
      year: current_date.year,
      month: current_date.month
    )
---
INSERT INTO "usage_trackings" ("user_id", "year", "month", "credits_used", "urls_processed", "youtube_count", "article_count", "created_at", "updated_at") VALUES (2, 2025, 9, 0, 0, 0, 0, '2025-09-02 06:16:11.289566', '2025-09-02 06:16:11.289566') RETURNING "id"

  def use_credit!(knowledge)
    setting = user_setting || create_default_settings
    usage = current_month_usage

    # CreditCalculator를 사용하여 실제 크레딧 계산
    calculator = CreditCalculator.new(knowledge)
    amount = calculator.calculate

    ActiveRecord::Base.transaction do
      setting.increment!(:used_credits, amount)
      usage.increment!(:credits_used, amount)
      usage.increment!(:urls_processed)

      # Knowledge에 소비된 크레딧 저장
      knowledge.update!(credits_consumed: amount)
---
UPDATE "user_settings" SET "used_credits" = COALESCE("used_credits", 0) + 2 WHERE "user_settings"."id" = 1
UPDATE "knowledges" SET "updated_at" = '2025-09-02 14:23:33.486119', "credits_consumed" = 2.0 WHERE "knowledges"."id" = 14