app/views/knowledges/_card.html.erb

      <span class="text-xs text-gray-400 ml-4">
        <%= time_ago_in_words(knowledge.created_at) %> ago
---
INSERT INTO "knowledges" ("user_id", "original_url", "title", "content", "summary", "content_type", "status", "thumbnail_url", "duration", "metadata", "created_at", "updated_at", "keywords", "published_at") VALUES (1, 'https://youtu.be/Fon0j9cndSg?si=_Jutr5g-jNX630lX', NULL, NULL, NULL, NULL, 'processing', NULL, NULL, '{}', '2025-09-01 07:01:58.292850', '2025-09-01 07:01:58.292850', NULL, NULL) RETURNING "id"