app/jobs/article_processor_job.rb

UPDATE "knowledges" SET "updated_at" = '2025-09-02 03:57:26.115825', "started_at" = '2025-09-02 03:57:26.112635' WHERE "knowledges"."id" = 9
---
  def perform(knowledge)
    Rails.logger.info "Starting article processing for knowledge ##{knowledge.id}"

    # 처리 시작 시간 기록
    knowledge.update(started_at: Time.current) if knowledge.respond_to?(:started_at=)

UPDATE "knowledges" SET "status" = 'failed', "updated_at" = '2025-09-02 14:23:34.476413', "error_message" = '기사 처리 중 오류: Failed to extract article content from https://medium.com/@evgeniy.lebedev/rust-made-easy-a-simple-guide-for-beginners-1fb1e38f8c77', "completed_at" = '2025-09-02 14:23:34.473566' WHERE "knowledges"."id" = 15
---
    Rails.logger.error e.backtrace.join("\n")

    # 에러 정보 저장
    knowledge.update(
      status: "failed",
      error_message: "기사 처리 중 오류: #{e.message}",
      completed_at: Time.current
    )