app/jobs/url_processor_job.rb

UPDATE "knowledges" SET "updated_at" = '2025-09-01 07:52:00.496122' WHERE "knowledges"."id" = 6
---
  # 재시도 설정: 지수 백오프로 최대 3회 재시도
  retry_on StandardError, wait: :exponentially_longer, attempts: 3 do |job, error|
    knowledge = job.arguments.first
    knowledge.update(
      status: "failed",
      error_message: "처리 실패: #{error.message}"
    )