app/jobs/youtube_processor_job.rb

UPDATE "knowledges" SET "title" = '김민수 용감하다. 계엄 관련 발언에 진행자 화들짝 막아버렸다', "content" = 'このビデオのトランスクリプトは現在取得できません。', "summary" = '요약 생성에 실패했습니다.', "content_type" = 'youtube', "status" = 'completed', "thumbnail_url" = 'https://i.ytimg.com/vi/Caj2X1vBHWM/hqdefault.jpg', "duration" = 525, "metadata" = '{"video_id":"Caj2X1vBHWM","title":"김민수 용감하다. 계엄 관련 발언에 진행자 화들짝 막아버렸다","description":"","channel":"성창경TV","thumbnail":"https://i.ytimg.com/vi/Caj2X1vBHWM/hqdefault.jpg","duration":525,"published_at":"2025-08-30T09:11:00.000+00:00"}', "updated_at" = '2025-08-30 15:13:19.609932' WHERE "knowledges"."id" = 1
---
  # 재시도 설정 - 5초, 25초, 125초 간격으로 재시도
  retry_on StandardError, wait: 5.seconds, attempts: 3 do |job, error|
    knowledge = job.arguments.first
    knowledge.update(
      status: "failed",
      error_message: "처리 실패: #{error.message}"
    )

UPDATE "knowledges" SET "updated_at" = '2025-09-02 14:28:59.744792', "started_at" = '2025-09-02 14:28:59.737867' WHERE "knowledges"."id" = 18
---
  def perform(knowledge)
    Rails.logger.info "Starting YouTube processing for knowledge ##{knowledge.id}"

    # 처리 시작 시간 기록
    knowledge.update(started_at: Time.current) if knowledge.respond_to?(:started_at=)

UPDATE "knowledges" SET "status" = 'failed', "updated_at" = '2025-09-02 03:59:40.249624', "error_message" = 'YouTube 처리 중 오류: private method `fetch_captions_via_api'' called for #<YoutubeService:0x0000000112cf8038 @youtube=#<Google::Apis::YoutubeV3::YouTubeService:0x00000001133b0d30 @root_url_template="https://youtube.$UNIVERSE_DOMAIN$/", @universe_domain="googleapis.com", @root_url="https://youtube.googleapis.com/", @base_path="", @client_name="google-apis-youtube_v3", @client_version="0.57.0", @upload_path="upload/", @batch_path="batch", @client_options=#<struct Google::Apis::ClientOptions application_name="unknown", application_version="0.0.0", proxy_url=nil, open_timeout_sec=nil, read_timeout_sec=nil, send_timeout_sec=nil, log_http_requests=false, transparent_gzip_decompression=true>, @request_options=#<struct Google::Apis::RequestOptions authorization=nil, retries=0, max_elapsed_time=900, base_interval=1, max_interval=60, multiplier=2, header=nil, normalize_unicode=false, skip_serialization=false, skip_deserialization=false, api_format_version=nil, use_opencensus=true, quota_project=nil, query=nil, add_invocation_id_header=false, upload_chunk_size=104857600>, @key="AIzaSyDe5GyZBWqVrxH6kyDge6CErvvUVCLFLWo">>', "completed_at" = '2025-09-02 03:59:40.245449' WHERE "knowledges"."id" = 10
---
    Rails.logger.error e.backtrace.join("\n")

    # 에러 정보 저장
    knowledge.update(
      status: "failed",
      error_message: "YouTube 처리 중 오류: #{e.message}",
      completed_at: Time.current
    )